import PopularProducts from "@/components/templates/index/PopularProducts";
import ProductTabs from "@/components/ui/ProductTabs";

export default function Layout({ children }: Readonly<{ children: React.ReactNode }>) {
  const mockData = {
    description: `چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد. چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد. چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.
    چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.
    چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.
    چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیا
    
    
    
    6654456
    
    
    
    
    
    
    
    
    ت متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.چه در حال تمرین و چه در زندگی روزمره، این کفش‌های اورجبنال نیوبالانس طوری طراحی شده‌اند که در هر نوع حرکت با شما همراه
    باشند. جزئیات متمرکز بر عملکرد مانند زیره میانی DynaSoft و زیره لاستیکی بادوام به این کفش وزن سبک و واکنش پذیری بالایی
    می بخشد که performance ورزشی شما را افزایش می دهد. ترکیب رنگی این کفش جذابیت و شادابی دو چندانی را به استایل اسپورت شما
    می بخشد.بخشد.`,

    specifications: [
      {
        title: "جنس",
        values: ["پارچه"],
      },
      {
        title: "جنس زیره",
        values: ["لاستیک"],
      },
      {
        title: "نحوه بسته شدن کفش",
        values: ["بندی"],
      },
      {
        title: "ویژگی‌های زیره",
        values: ["انعطاف پذیر", "دارای بالشتک هوا", "قابلیت ارتجاعی", "قابلیت گردش هوا", "کاهش فشار وارده", "مقاوم در برابر سایش"],
      },
    ],
    comments: [
      {
        id: "1",
        title: "با این قیمت کاملا مناسب و خوبه",
        content: "برا کسایی که نمیخوان هزینه بالایی کنن گزینه خیلی خوبیه",
        date: "10 شهریور 1403",
        isRecommended: true,
        isBuyer: true,
        likes: 32,
        dislikes: 76,
        replies: [
          {
            id: "2",
            title: "با این قیمت اصلا مناسب نیست",
            content: "اصلا خوب نیست",
            date: "20 شهریور 1403",
            isRecommended: false,
            isBuyer: true,
            likes: 100,
            dislikes: 100,
            replies: [
              {
                id: "2",
                title: "با این قیمت اصلا مناسب نیست",
                content: "اصلا خوب نیست",
                date: "20 شهریور 1403",
                isRecommended: false,
                isBuyer: true,
                likes: 100,
                dislikes: 100,
                replies: [],
              },
            ],
          },
        ],
      },
      {
        id: "2",
        title: "با این قیمت اصلا مناسب نیست",
        content: "اصلا خوب نیست",
        date: "20 شهریور 1403",
        isRecommended: false,
        isBuyer: true,
        likes: 100,
        dislikes: 100,
        replies: [],
      },
      {
        id: "2",
        title: "با این قیمت اصلا مناسب نیست",
        content: "اصلا خوب نیست",
        date: "20 شهریور 1403",
        isRecommended: false,
        isBuyer: true,
        likes: 100,
        dislikes: 100,
        replies: [],
      },
      {
        id: "2",
        title: "با این قیمت اصلا مناسب نیست",
        content: "اصلا خوب نیست",
        date: "20 شهریور 1403",
        isRecommended: false,
        isBuyer: true,
        likes: 100,
        dislikes: 100,
        replies: [],
      },
      {
        id: "2",
        title: "با این قیمت اصلا مناسب نیست",
        content: "اصلا خوب نیست",
        date: "20 شهریور 1403",
        isRecommended: false,
        isBuyer: true,
        likes: 100,
        dislikes: 100,
        replies: [],
      },
    ],
  };

  return (
    <>
      {children}
      <PopularProducts />
      <ProductTabs description={mockData.description} specifications={mockData.specifications} comments={mockData.comments} />
    </>
  );
}
