export const faqData = [
  {
    category: 'ارسال و تحویل',
    items: [
      {
        question: 'مدت زمان تحویل سفارش چقدر است؟',
        answer: 'زمان تحویل معمولاً بین 3 تا 5 روز کاری است. برای سفارش‌های خاص ممکن است این زمان کمی طولانی‌تر شود',
      },
      {
        question: 'آیا امکان ارسال به شهرستان‌ها وجود دارد؟',
        answer: 'بله، سفارش‌ها به تمام نقاط ایران از طریق پست یا شرکت‌های حمل‌ونقل ارسال می‌شوند',
      },
      {
        question: 'چگونه می‌توانم سفارش خود را پیگیری کنم؟',
        answer:
          'پس از ثبت سفارش، کد رهگیری برای شما ارسال می‌شود. می‌توانید وضعیت سفارش خود را از طریق بخش “پیگیری سفارش” سایت بررسی کنید.',
      },
    ],
  },
  {
    category: 'معرفی محصولات',
    items: [
      {
        question: 'برچسب‌های چاپی چه تفاوتی با کاترپلاتری دارند؟',
        answer:
          'برچسب‌های چاپی دارای تصاویر و رنگ‌های متنوع هستند و برای طرح‌های پیچیده‌تر مناسب‌اند، در حالی که برچسب‌های کاترپلاتری بیشتر برای طرح‌های تک‌رنگ و ساده به کار می‌روند',
      },
      {
        question: 'برچسب‌های کاترپلاتری چیست؟',
        answer:
          'برچسب‌های کاترپلاتری نوعی برچسب هستند که به صورت دقیق و ظریف با دستگاه کاتر برش داده می‌شوند. این برچسب‌ها معمولاً بدون پس‌زمینه هستند و برای تزئین یا تبلیغات روی ماشین و دیگر سطوح استفاده می‌شوند',
      },
    ],
  },
  {
    category: 'کیفیت و ویژگی ها',
    items: [
      {
        question: 'چگونه می‌توانم از کیفیت برچسب‌ها مطمئن شوم؟',
        answer: 'ما از مواد اولیه با کیفیت بالا استفاده می‌کنیم و تمامی محصولات قبل از ارسال بررسی می‌شوند',
      },
      {
        question: 'برچسب‌ها ضد آب هستند؟',
        answer: 'بله، تمامی برچسب‌های ما ضد آب و مقاوم در برابر شرایط جوی مانند باران و آفتاب هستند',
      },
    ],
  },
  {
    category: 'خدمات و سفارش سازی',
    items: [
      {
        question: 'آیا امکان سفارش طرح دلخواه وجود دارد؟',
        answer: 'بله، شما می‌توانید طرح مورد نظر خود را برای ما ارسال کنید و ما آن را برای شما آماده و ارسال می‌کنیم',
      },
    ],
  },
  {
    category: 'نحوه نصب و استفاده',
    items: [
      {
        question: 'آیا می‌توان برچسب را روی هر سطحی نصب کرد؟',
        answer:
          'بله، برچسب‌های ما روی سطوح صاف و تمیز مانند شیشه، فلز، پلاستیک و حتی برخی دیوارها قابل نصب هستند. با این حال، برای بهترین نتیجه، باید سطح تمیز و خشک باشد',
      },
    ],
  },
  {
    category: 'پرداخت و مالی',
    items: [
      {
        question: 'چگونه می‌توانم سفارش خود را پرداخت کنم؟',
        answer: 'پرداخت سفارش از طریق درگاه امن بانکی سایت انجام می‌شود. همچنین امکان پرداخت در محل برای برخی مناطق فعال است',
      },
    ],
  },
];
