export const errorPhoneNumberStepMessages: Record<number, string> = {
  400: 'شماره نامعتبر است',
  403: 'درخواست زیاد بود، بعداً تلاش کنید',
  409: 'کد قبلاً ارسال شده است',
  429: 'تعداد درخواست بیش از حد مجاز بود',
  500: 'خطای سرور',
};

export const errorOtpStepMessages: Record<number, string> = {
  400: 'کد وارد شده نادرست است.',
  403: 'تلاش بیش‌از‌حد. بعداً امتحان کنید.',
  409: 'کد قبلاً ارسال شده است.',
  429: 'درخواست زیاد بود. بعداً تلاش کنید.',
  500: 'خطای سرور. دوباره امتحان کنید.',
};
